### Paso 1: Configurar el router

a.     Acceda al router mediante el puerto de consola y habilite el modo EXEC con privilegios.

Abra la ventana de configuración

```
Router> enable
```

b.     Ingrese al modo de configuración.

```
Router# config terminal
```

c.     Asigne el nombre de dispositivo al router.

```
Router(config)# hostname R1
```

d.     Asigne class como la contraseña cifrada del modo EXEC privilegiado.

```
R1(config)# enable secret class
```

e.     Asigne cisco como la contraseña de la consola y habilite el inicio de sesión.

```
R1(config)# line console 0
R1(config-line)# password cisco
R1(config-line)# login
R1(config-line)# exit
```

f.      Asigne cisco como la contraseña de vty y habilite el inicio de sesión.

```
R1(config)# line vty 0 4
R1(config-line)# password cisco
R1(config-line)# login
R1(config-line)# exit
```

g.     Encripte las contraseñas de texto sin formato.

```
R1(config)# service password-encryption
```

h.     Cree un aviso que advierta a todo el que acceda al dispositivo que el acceso no autorizado está prohibido.

```
R1(config)# banner motd $ Authorized Users Only! $
```

i.      Configure y active las dos interfaces en el router.

```
R1(config)# interface g0/0/0
R1(config-if)# ip address 192.168.0.1 255.255.255.0
R1(config-if)# ipv6 address 2001:db8:acad::1/64
R1(config-if)# ipv6 address fe80::1 link-local
R1(config-if)# no shutdown
R1(config-if)# exit
R1(config)# interface g0/0/1
R1(config-if)# ip address 192.168.1.1 255.255.255.0
R1(config-if)# ipv6 address 2001:db8:acad:1::1/64
R1(config-if)# ipv6 address fe80::1 link-local
R1(config-if)# no shutdown
R1(config-if)# exit
```

j.      Configure una descripción de interfaz para cada interfaz e indique qué dispositivo está conectado.

```
R1(config)# interface g0/0/1
R1(config-if)# description Connected to F0/5 on S1
R1(config-if)# exit
R1(config)# interface g0/0/0
R1(config-if)# description Connected to Host PC-B
R1(config-if)# exit
```

k.     Para habilitar el enrutamiento IPv6, ingrese el comando ipv6 unicast-routing.

```
R1(config)# ipv6 unicast-routing
```

l.      Guardar la configuración en ejecución en el archivo de configuración de inicio

```
R1(config)# exit
R1# copy running-config startup-config
```

m.   Configure el reloj en el router.

```
R1# clock set 15:30:00 25 Dec 2020
```

Nota: Utilice el signo de interrogación (?) para poder determinar la secuencia correcta de parámetros necesarios para ejecutar este comando.

Cerrar la ventana de configuración

### Paso 2: Configure el switch.

En este paso, configurará el nombre de host, la interfaz de VLAN 1 y su puerta de enlace predeterminada.

Abrir la ventana de configuración

a.     Acceda al switch mediante el puerto de consola y habilite al modo EXEC con privilegios.

```
Switch> enable
```

b.     Ingrese al modo de configuración.

```
Switch# config terminal

```
c.     Asigne un nombre de dispositivo al switch.

```
Switch(config)# hostname S1
```

d.     Configure y active la interfaz VLAN en el switch S1.

```
S1(config)# interface vlan 1
S1(config-if)# ip address 192.168.1.2 255.255.255.0
S1(config-if)# no shutdown
S1(config-if)# exit
```

e.     Configure la puerta de enlace predeterminada para el switch S1.

```
S1(config)# ip default-gateway 192.168.1.1
S1(config-if)# exit
```

f.      Guardar la configuración en ejecución en el archivo de configuración de inicio

### Paso 1: Mostrar la tabla de routing en el router.

a.     Utilice el comando show ip route en R1 para responder las preguntas siguientes.

Abra la ventana de configuración

```
R1# show ip route

Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP

       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     192.168.0.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.0.0/24 is directly connected, GigabitEthernet0/0/0
L 192.168.0.1/32 is directly connected, GigabitEthernet0/0/0
     192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.1.0/24 is directly connected, GigabitEthernet0/0/1
L 192.168.1.1/32 is directly connected, GigabitEthernet0/0/1
```

### Paso 2: Muestre la información de la interfaz en el R1.

a.     Utilice el comando show interface g0/0/1 para responder las preguntas siguientes.

```
R1# show interface g0/0/1

GigabitEthernet0/0/1 is up, line protocol is up (connected)
  Hardware is Lance, address is 0060.4731.8102 (bia 0060.4731.8102)
  Descripción: Conectada a F0/5 en S1
  Internet address is 192.168.1.1/24
  MTU 1500 bytes, BW 1000000 Kbit, DLY 100 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Dúplex completo, 100 MB/s, tipo de medios es RJ45
  ARP type: ARPA, ARP Timeout 04:00:00,
  Last input 00:00:08, output 00:00:05, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0 (size/max/drops); Total output drops: 0
  Queueing strategy: fifo

  Output queue :0/40 (size/max)

  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 72 bits/sec, 0 packets/sec
     17 packets input, 1696 bytes, 0 no buffer
     Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     0 input packets with dribble condition detected
     99 packets output, 8160 bytes, 0 underruns
     0 output errors, 0 collisions, 1 interface resets
     0 babbles, 0 late collision, 0 deferred
     0 lost carrier, 0 no carrier
     0 output buffer failures, 0 output buffers swapped out
```


### Paso 3: Mostrar una lista de resumen de las interfaces del router y del switch

Existen varios comandos que se pueden utilizar para verificar la configuración de interfaz. Uno de los más útiles es el comando show ip interface brief. El resultado del comando muestra una lista resumida de las interfaces en el dispositivo y brinda información inmediata sobre el estado de cada interfaz.

a.     Ingrese el comando show ip interface brief en R1.

```
R1# show ip interface brief

Interface IP-Address OK? Method Status Protocol
GigabitEthernet0/0/0 192.168.0.1 YES manual up up
GigabitEthernet0/0/1 192.168.1.1 YES manual up up
GigabitEthernet0/1/0 unassigned YES unset up down
GigabitEthernet0/1/1 unassigned YES unset up down
GigabitEthernet0/1/2 unassigned YES unset up down
GigabitEthernet0/1/3 unassigned YES unset up down
Vlan1 unassigned YES unset administratively down down
```

b.     Ingrese el comando show ipv6 interface brief en R1 para ver información de IPv6 de las interfaces.

```
R1# show ipv6 interface brief

GigabitEthernet0/0/0 [up/up]
    FE80::1
    2001:DB8:ACAD::1

GigabitEthernet0/0/1 [up/up]
    FE80::1
    2001:DB8:ACAD:1::1

GigabitEthernet0/1/0 [up/down]
GigabitEthernet0/1/1 [up/down]
GigabitEthernet0/1/2 [up/down]
GigabitEthernet0/1/3 [up/down]
Vlan1 [administratively down/down]
    unassigned
```

Cerrar la ventana de configuración

c.     Ingrese el comando show ip interface brief en S1.

Abrir la ventana de configuración

```
S1# show ip interface brief

Interface IP-Address OK? Method Status Protocol
FastEthernet0/1 unassigned YES manual down down
FastEthernet0/2 unassigned YES manual down down
FastEthernet0/3 unassigned YES manual down down
FastEthernet0/4 unassigned YES manual down down
FastEthernet0/5 unassigned YES manual up up
FastEthernet0/6 unassigned YES manual up up
FastEthernet0/7 unassigned YES manual down down
FastEthernet0/8 unassigned YES manual down down
FastEthernet0/9 unassigned YES manual down down
FastEthernet0/10 unassigned YES manual down down
FastEthernet0/11 unassigned YES manual down down
FastEthernet0/12 unassigned YES manual down down
FastEthernet0/13 unassigned YES manual down down
FastEthernet0/14 unassigned YES manual down down
FastEthernet0/15 unassigned YES manual down down
FastEthernet0/16 unassigned YES manual down down
FastEthernet0/17 unassigned YES manual down down
FastEthernet0/18 unassigned YES manual down down
FastEthernet0/19 unassigned YES manual down down
FastEthernet0/20 unassigned YES manual down down
FastEthernet0/21 unassigned YES manual down down
FastEthernet0/22 unassigned YES manual down down
FastEthernet0/23 unassigned YES manual down down
FastEthernet0/24 unassigned YES manual down down
GigabitEthernet0/1 unassigned YES manual down down
GigabitEthernet0/2 unassigned YES manual down down
Vlan1 192.168.1.2 YES manual up up
```