### Paso 1: Configurar los parámetros básicos para cada router.

a.     Establezca una conexión de consola entre un router y la PC en la mesa.

b.     Desde la ventana del terminal en la PC, establezca una sesión de terminal hacia el router.

Abra una ventana de configuración

c.     Asigne el nombre de dispositivo correcto a cada uno de los dos routers.

```
Router(config)# hostname BR1
Router(config)# hostname BR2
```

d.     Asigne class como la contraseña cifrada del modo EXEC privilegiado.

```
BR1(config)# enable secret class

BR2(config)# enable secret class
```

e.     Asigne cisco como la contraseña de la consola y habilitar el inicio de sesión para los routers.

```
BR1(config)# line con 0
BR1(config-line)# password cisco
BR1(config-line)# login

BR2(config)# line con 0
BR2(config-line)# password cisco
BR2(config-line)# login
```

f.      Asigne cisco como la contraseña vty y habilite el inicio de sesión para los routers.

```
BR1(config)# line vty 0 4
BR1(config-line)# password cisco
BR1(config-line)# login

BR2(config)# line vty 0 4
BR2(config-line)# password cisco
BR2(config-line)# login
```

g.     Cifre las contraseñas de texto sin formato.

```
BR1(config)# service password-encryption

BR2(config)# service password-encryption
```

h.     Cree un banner que advierta a cualquiera que acceda al dispositivo que el acceso no autorizado está prohibido en ambos routers.

```
BR1(config)# banner motd $ Unauthorized Access is Prohibited $

BR2(config)# banner motd $ Unauthorized Access is Prohibited $
```

### Paso 2: Configurar las interfaces en cada router.

a.     Asigne una dirección IP y una máscara de subred a cada interfaz por medio de la tabla que completó en la parte 2.

```
BR1(config)# interface g0/0/0
BR1(config-if)# ip address 192.168.33.249 255.255.255.252
BR1(config-if)# interface g0/0/1
BR1(config-if)# ip address 192.168.33.129 255.255.255.192

BR2(config)# interface g0/0/0
BR2(config-if)# ip address 192.168.33.250 255.255.255.252
BR2(config-if)# interface g0/0/1
BR2(config-if)# ip address 192.168.33.193 255.255.255.224
```

b.     Configure una descripción de interfaz para cada interfaz.

```
BR1(config)# interface g0/0/0
BR1(config-if)# description BR1-BR2 Link
BR1(config-if)# interface g0/0/1
BR1(config-if)# description Connected to S1

BR2(config-if)# interface g0/0/0
BR2(config-if)# description BR1-BR2 Link
BR2(config-if)# interface g0/0/1
BR2(config-if)# description Connected to **S2**
```

c.     Active las interfaces.

```
BR1(config)# interface g0/0/0
BR1(config-if)# no shutdown
BR1(config-if)# interface g0/0/1
BR1(config-if)# no shutdown

BR2(config)# interface g0/0/0
BR2(config-if)# no shutdown
BR2(config-if)# interface g0/0/1
BR2(config-if)# no shutdown
```

### Paso 3: Guardar la configuración en todos los dispositivos.

```
BR1# copy running-config startup-config

BR2# copy running-config startup-config
```