## Parte 1: Configurar y verificar los parámetros básicos del switch

a.     En el Tablero de Cables, haga clic en un cable de consola . Conecte el cable de la consola entre S1 y PC-A.

b.     Establezca una conexión de consola al conmutador S1 desde PC-A mediante el programa Terminal genérico de Packet Tracer (PC-A > Desktop > Terminal). Presione Enter (Ingresar) para llegar al sistema del Switch.

c.     Puede acceder a todos los comandos del switch en el modo EXEC privilegiado. El conjunto de comandos EXEC privilegiados incluye aquellos comandos del modo EXEC del usuario, así como también el comando configure a través del cual se obtiene acceso a los modos de comando restantes. Ingrese al modo EXEC privilegiado introduciendo el comando enable.

Abrir la ventana de configuración
```
Switch> enable
Switch#
```


d.     La petición de entrada cambió de Switch> a Switch#, lo que indica que está en el modo EXEC privilegiado. Ingresar al modo de configuración global.

```
Switch# configure terminal
```

Enter configuration commands, one per line. End with CNTL/Z.

```
Switch(config)#
```

e.     El sistema cambió a Switch(config)# para reflejar el modo de configuración global. Dele un nombre al switch de acuerdo con la Tabla de Direccionamiento.

```
Switch(config)# hostname S1
```

f.      Introduzca contraseñas locales. Utilice cisco como contraseña de EXEC del usuario y class como contraseña de EXEC privilegiado.

```
S1(config)# enable secret class
S1(config)# line con 0
S1(config-line)# password cisco
S1(config-line)# login
S1(config-line)# exit
```
g.     Configure y active la interface VLAN1 de acuerdo con la Tabla de Direccionamiento. 

```
S1(config)# interface vlan 1
S1(config-if)# ip address 192.168.1.1 255.255.255.0
S1(config-if)# no shutdown
```

h.     Se debe configurar un aviso de inicio de sesión, conocido como “mensaje del día” (MOTD), para advertir a cualquier persona que acceda al switch que no se tolerará el acceso no autorizado. Configure un banner MOTD apropiado para advertir sobre el acceso no autorizado.

```
S1 (config) # banner motd #
Escriba un mensaje de texto. Termina con el carácter «#».

El acceso no autorizado está prohibido y los infractores se procesarán en la medida en que lo permita la ley. #

S1(config)# exit

```

i.      Guardar la configuración  al archivo de inicio en la memoria de acceso aleatoria no-volátil (NVRAM).

```
S1# copy running-config startup-config
Destination filename [startup-config]? [Enter]
Building configuration...
[OK]
S1#
```
j.      Muestre la configuración actual.

```
S1# show running-config

Building configuration...

<output omitted>
```

k.     Muestre la versión del IOS y otra información útil del switch.

```
S1# show version

Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 15.0(2)SE, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2012 by Cisco Systems, Inc.
Compiled Sat 28-Jul-12 00:29 by prod_rel_team

<output omitted>
```

l.      Muestre el estado de las interfaces conectadas en el switch.

```
S1# show ip interface brief

Interface IP-Address OK? Method Status Protocol
FastEthernet0/1 unassigned YES unset up up     
FastEthernet0/2 unassigned YES unset down down   

<output omitted>

FastEthernet0/3 unassigned YES unset down down   
FastEthernet0/4 unassigned YES unset down down   
FastEthernet0/5 unassigned YES unset down down   
FastEthernet0/6 unassigned YES unset up up
FastEthernet0/24 unassigned YES manual down down
GigabitEthernet0/1 unassigned YES manual down down
GigabitEthernet0/2 unassigned YES manual down down
Vlan1 192.168.1.1 YES manual up up
S1#
```

 ![](https://www.youtube.com/watch?v=9gkDvjH-CUU&t)